
public class C0725_07_최종정리_2차원배열 {

	public static void main(String[] args) {
		
		// 2차원 배열

		
//		--------------------------------------------------------------------
		
		// Q2.
		// 2차원 배열에 랜덤번호를 입력해서
		// 2차원 배열을 출력하시오. (25개)
		// 21 1 5 9 30
		// 7 6 33 44 45
		
		// 1) 2차원 배열 선언
		int[][] arr = new int[5][5];
		int[] rnum = new int[25];	
		
		// 2) 배열값 입력
		for (int i=0; i<arr.length; i++) {
			rnum[i] = (int)(Math.random()*25)+1;
		}
		
		// 3) 랜덤섞기
		for (int i=0; i<arr.length; i++) {
			
		}
		
		// 배열 출력

		
//		--------------------------------------------------------------------
//		// Q1.
//		// 1차원 배열 25개를 1~25까지 입력하여
//		// 랜덤으로 섞어서 출력하시오.
//		// 순차출력: 1 2 3 4 5 6 7 ... 25까지 출력 먼저하고,
//		// 랜덤출력: 21 1 5 9 30 ..... 25개 출력되도록 하시오.
//		
//		// 1) 1차원 배열 선언
//		int[] num = new int[25];
//		int[] rnum = new int[25];
//		
//		// 2) 배열값 입력
//		for (int i=0; i<25; i++) {
//			num[i] = i+1;
//			rnum[i] = (int)(Math.random()*25)+1;
//		}
//		for (int i=0; i<25; i++) {
//			
//		}
//		
//		// 3) 배열 출력
//		System.out.print("순차출력: ");
//		for (int i=0; i<25; i++) {
//			System.out.print(num[i]+" ");
//		}
//		System.out.println();
//		System.out.print("랜덤출력: ");
//		for (int i=0; i<25; i++) {
//			System.out.print(rnum[i]+" ");
//		}
		
//		--------------------------------------------------------------------
//		// 1. 2차원 배열 생성
//		int[][] score = new int[5][5];
//		for (int i=0; i<5; i++) {
//			for (int j=0; j<5; j++) {
//				score[i][j] = (5*i)+j+1;  // 공식
//			}
//		}
//		// 2. 2차원 배열 출력
//		for (int i=0; i<5; i++) {
//			for (int j=0; j<5; j++) {
//				System.out.print(score[i][j]+"\t");
//			}
//			System.out.println();
//		}
//		
//		
//		--------------------------------------------------------------------

		
		
		
	}

}
